
print('Задание 1', '\n','Введите число')

x=int(input())
if x>7:
    print('Привет')

print('Задание 2')

x=input()
if x=='Вячеслав':
    print('Привет, Вячеслав')
else:
    print('Нет такого имени')

print('Задание 3')

print('Вариант первый ')
array=[1,2,3,4,5,6,7,8,9,21,27,30,33]
print("Исходный массив чисел ",array)
print('Числа из массива, кратные 3 ')
for i in array:
    if i % 3==0:
        print(i)

print('Вариант второй со вводом чисел в консоли')
array=[int(input('Введите шесть чисел ')),int(input()),int(input()),int(input()),int(input()),int(input())]
print('Числа из массива, кратные 3 ')
for i in array:
    if i % 3==0:
        print(i)

print('Задание 4')

print('[((())()(())]] #исходный набор скобок')

print('[[(())()(())]] #исправленный набор скобок, вторая круглая скобка от начала строки заменена на квадратную')
y=input('Нажмите любую клавишу')





    
























































